#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/omshub/core-api/runs/run-7DNogipgDC4qQBMc

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_app.app-core-api: Refreshing state... [id=3633547f-7025-4307-9b7e-7caa2486d1ae]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # digitalocean_app.app-core-api has changed
  ~ resource "digitalocean_app" "app-core-api" {
      ~ active_deployment_id = "ba54a04a-017a-4560-aad0-175df1fd7e80" -> "7554bcec-dc05-4943-83fe-cd214127016b"
        id                   = "3633547f-7025-4307-9b7e-7caa2486d1ae"
      ~ updated_at           = "2022-05-17 07:51:34 +0000 UTC" -> "2022-05-17 07:53:01 +0000 UTC"
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # digitalocean_app.app-core-api will be destroyed
  # (because digitalocean_app.app-core-api is not in configuration)
  - resource "digitalocean_app" "app-core-api" {
      - active_deployment_id = "7554bcec-dc05-4943-83fe-cd214127016b" -> null
      - created_at           = "2022-05-17 07:48:15 +0000 UTC" -> null
      - default_ingress      = "https://core-api-2fh5t.ondigitalocean.app" -> null
      - id                   = "3633547f-7025-4307-9b7e-7caa2486d1ae" -> null
      - live_url             = "https://core-api-2fh5t.ondigitalocean.app" -> null
      - updated_at           = "2022-05-17 07:53:01 +0000 UTC" -> null

      - spec {
          - domains = [] -> null
          - name    = "core-api" -> null
          - region  = "nyc" -> null

          - service {
              - dockerfile_path    = "Dockerfile" -> null
              - http_port          = 1927 -> null
              - instance_count     = 1 -> null
              - instance_size_slug = "basic-xxs" -> null
              - internal_ports     = [] -> null
              - name               = "core-api" -> null

              - env {
                  - key   = "NEWRELIC_API_KEY" -> null
                  - scope = "RUN_TIME" -> null
                  - type  = "SECRET" -> null
                  - value = (sensitive value)
                }
              - env {
                  - key   = "NEWRELIC_APP_NAME" -> null
                  - scope = "RUN_TIME" -> null
                  - value = (sensitive value)
                }

              - github {
                  - branch         = "ci/digitalocean-app-platform" -> null
                  - deploy_on_push = false -> null
                  - repo           = "omshub/core-api" -> null
                }

              - routes {
                  - path                 = "/" -> null
                  - preserve_path_prefix = false -> null
                }
            }
        }
    }

  # digitalocean_app.app_core_api will be created
  + resource "digitalocean_app" "app_core_api" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "core-api"
          + region  = "nyc1"

          + domain {
              + name     = (known after apply)
              + type     = (known after apply)
              + wildcard = (known after apply)
              + zone     = (known after apply)
            }

          + service {
              + dockerfile_path    = "Dockerfile"
              + http_port          = 1927
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "core-api"
              + run_command        = (known after apply)

              + github {
                  + branch         = "main"
                  + deploy_on_push = false
                  + repo           = "omshub/core-api"
                }

              + routes {
                  + path = "/"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pushed by: @disposedtrolley, Action: `pull_request`*
<!-- Sticky Pull Request Commentterraform -->